ovrebekk/nrf52-timelapse-board-controller/main.cpp
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}


static void stepper_timer_timeout_handler(void *p)
{
    stepper_controller_stepper_set(0, 0);
}

static void steppers_init(void)
{
    // Stepper library init
    stpctrl_config_t config;
    config.stepper_1.pin_ch_a  = 17;
    config.stepper_1.pin_ch_an = 18;
    config.stepper_1.pin_ch_b  = 19;
    config.stepper_1.pin_ch_bn = 20;
    config.stepper_1.pwm_ctrl_index = 0;
    stepper_controller_init(&config);

    // Stepper timer init
    app_timer_create(&m_stepper_set_timer_id, APP_TIMER_MODE_REPEATED, stepper_timer_timeout_handler);
    app_timer_start(m_stepper_set_timer_id, APP_TIMER_TICKS(100), 0);
}

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool     erase_bonds;

    // Initialize.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    uart_init();
    log_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    steppers_init();

    printf("\rTimelapse controller start!\r\n");
    NRF_LOG_INFO("Timelapse Controller Start!");
    err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
        UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
        power_manage();
    }
}


/**
 * @}
 */
